Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh94-v2.tmx
Source language: bo
Languages: en

source: སྲས་ནི་དགའ་བས་འགྲོ་ཞེས་བྱའོ། །
en: Joyous Movement will be his son.

source: རིམ་གྲོ་པ་ནི་ནོར་བུའི་འོད་ཅེས་བྱའོ། །
en: Jewel Light will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཡེ་ཤེས་དཔའ་བོ་ཞེས་བྱའོ། །
en: Wisdom Hero will be foremost in terms of insight,

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་སྟོབས་བརྟན་ཞེས་བྱའོ། །
en: and Stable Power will be foremost in terms of miraculous abilities.

source: འདུས་པ་དང་པོ་ལ་ནི་ཉན་ཐོས་དུང་ཕྱུར་ཕྲག་བརྒྱད་དང་ཁྲི་ཕྲག་གསུམ་མོ། །གཉིས་པ་ལ་ནི་དེ་ཉིས་འགྱུར་རོ། །འདུས་པ་གསུམ་པ་ལ་ནི་ཁྲི་ཕྲག་དྲུག་གོ། །
en: His first congregation will consist of eight hundred million thirty thousand hearers, his second of twice as many hearers, and his third of sixty thousand hearers.

source: སྐུ་ཚེའི་ཚད་ནི་ལོ་འབུམ་མོ། །
en: The extent of his lifespan will be one hundred thousand years.

source: དམ་པའི་ཆོས་ནི་ལོ་འབུམ་ལྔ་ཁྲིའི་བར་དུ་གནས་སོ། །
en: His sacred Dharma will remain for five hundred ten thousand years.

source: དེ་བཞིན་གཤེགས་པ་རྣམ་པར་སྣང་མཛད་སྐྱེ་བའི་ཡུལ་ནི་གྲོང་ཁྱེར་ཆོས་བཟང་ཞེས་བྱའོ། །
en: “The birthplace of the thus-gone Vairocana will be the city called Excellent Dharma.

source: འོད་ནི་དཔག་ཚད་དགུའོ། །
en: His light will extend nine leagues.

source: ཡབ་ནི་རྒྱལ་བ་ཞེས་བྱའོ། །
en: Conqueror will be his father.

source: ཡུམ་ནི་མེ་ཏོག་བཟང་ཞེས་བྱའོ། །
en: Excellent Flower will be his mother.

source: སྲས་ནི་བཞིན་འདྲ་ཞེས་བྱའོ། །
en: Same Image will be his son.

source: རིམ་གྲོ་པ་ནི་ཡུལ་འཁོར་བཟང་ཞེས་བྱའོ། །
en: Land of Excellence will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཤིན་ཏུ་བཟང་པོ་ཞེས་བྱའོ། །
en: Utter Excellence will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་དགའ་བ་ཅན་ཞེས་བྱའོ། །
en: Joyous will be foremost in terms of miraculous abilities.

source: འདུས་པ་དང་པོ་ལ་ནི་ཉན་ཐོས་དྲུག་འབུམ་ཉི་ཁྲིའོ། །གཉིས་པ་ལ་ནི་དྲུག་འབུམ་ཆིག་ཁྲིའོ། །གསུམ་པ་ལ་ནི་དྲུག་འབུམ་མོ། །
en: His first congregation will consist of six hundred twenty thousand hearers, his second of six hundred ten thousand hearers, and his third of six hundred thousand hearers.

source: སྐུ་ཚེའི་ཚད་ནི་ལོ་ལྔ་བརྒྱའོ། །
en: The extent of his lifespan will be five hundred years.

source: དམ་པའི་ཆོས་ནི་ལོ་བཞི་ཁྲི་བརྒྱད་སྟོང་གི་བར་དུ་གནས་སོ། །
en: His sacred Dharma will remain for forty-eight thousand years.

source: དེ་བཞིན་གཤེགས་པ་ཉི་མའི་སྙིང་པོ་སྐྱེ་བའི་ཡུལ་ནི་གྲོང་ཁྱེར་མེ་ཏོག་ཅན་ཞེས་བྱའོ། །
en: “The birthplace of the thus-gone Sūryagarbha will be the city called Endowed with Flowers.

source: འོད་ནི་དཔག་ཚད་ཉིས་བརྒྱའོ། །
en: His light will extend two hundred leagues.

source: ཡབ་ནི་འབྱོར་ལྡན་ཞེས་བྱའོ། །
en: Wealth Possessor will be his father.

source: སྲས་ནི་སྐར་མཁན་ཞེས་བྱའོ། །
en: Star Knower will be his son.

source: རིམ་གྲོ་པ་ནི་ཡེ་ཤེས་བླ་མ་ཞེས་བྱའོ། །
en: Highest Wisdom will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཤེས་རབ་སྡེ་ཞེས་བྱའོ། །
en: Force of Insight will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་རྡོ་རྗེའི་སྡེ་ཞེས་བྱའོ། །
en: Vajra Force will be foremost in terms of miraculous abilities.

source: འདུས་པ་དང་པོ་ལ་ནི་ཉན་ཐོས་ཀྱི་དགེ་སློང་འབུམ་མོ། །གཉིས་པ་ལ་ནི་ཐེར་འབུམ་མོ། །འདུས་པ་གསུམ་པ་ལ་ནི་ཉན་ཐོས་དཀྲིགས་ཕྲག་བརྒྱད་དོ། །བཞི་པ་ལ་ནི་ས་ཡ་ཕྲག་དགུའོ། །
en: His first congregation will consist of one hundred thousand monks, his second of one billion hearers, his third of eight hundred quadrillion hearers, and his fourth of nine million hearers.

source: སྐུ་ཚེའི་ཚད་ནི་ལོ་དུང་ཕྱུར་ཕྲག་བདུན་ནོ། །
en: The extent of his lifespan will be seven hundred million years.

source: དེ་བཞིན་གཤེགས་པ་ཟླ་བ་སྐྱེ་བའི་ཡུལ་ནི་རིན་ཆེན་མཆོག་ཅེས་བྱའོ། །
en: “The birthplace of the thus-gone Candra will be known as Supreme Jewel.

source: ཡབ་ནི་ཙམ་པའི་མིག་ཅེས་བྱའོ། །
en: Campaka Eye will be his father.

source: ཡུམ་ནི་སྨན་ཅེས་བྱའོ། །
en: Medicine will be his mother.

source: སྲས་ནི་ནབ་སོ་ཞེས་བྱའོ། །
en: Punarvasu will be his son.

source: རིམ་གྲོ་པ་ནི་ཤིན་ཏུ་འཇིགས་མེད་ཅེས་བྱའོ། །
en: Utterly Fearless will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཤེས་རབ་བླ་མ་ཞེས་བྱའོ། །
en: Highest Insight will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཆོས་འཕགས་ཞེས་བྱའོ། །
en: Superior Dharma will be foremost in terms of miraculous abilities.

source: འདུས་པ་དང་པོ་ལ་ནི་ཉན་ཐོས་བྱེ་བ་བརྒྱ་ཕྲག་བཅུ་གཉིས་སོ། །གཉིས་པ་ལ་ནི་བྱེ་བ་བརྒྱ་ཕྲག་བཅུ་བཞིའོ། །འདུས་པ་གསུམ་པ་ལ་ནི་ཉན་ཐོས་བྱེ་བ་བརྒྱ་ཕྲག་བཅྭ་བརྒྱད་དོ། །བཞི་པ་ལ་ནི་ཉན་ཐོས་བྱེ་བ་བརྒྱ་ཕྲག་ཉི་ཤུའོ། །
en: His first congregation will consist of twelve billion hearers, his second of fourteen billion hearers, his third of eighteen billion hearers, and his fourth of twenty billion hearers.

source: སྐུ་ཚེའི་ཚད་ནི་ལོ་དྲུག་སྟོང་ངོ་། །
en: The extent of his lifespan will be six thousand years.

source: དམ་པའི་ཆོས་ནི་ལོ་ཁྲི་ཆིག་སྟོང་གི་བར་དུ་གནས་སོ། །
en: His sacred Dharma will remain for eleven thousand years.

source: དེ་བཞིན་གཤེགས་པ་འོད་འཕྲོ་སྐྱེ་བའི་ཡུལ་ནི་གྲོང་ཁྱེར་རྡུལ་བཟངས་ཞེས་བྱའོ། །
en: “The birthplace of the thus-gone Arciṣmat will be the city called Excellent Dust.

source: འོད་ནི་དཔག་ཚད་དྲུག་ཅུའོ། །
en: His light will extend sixty leagues.

source: ཡབ་ནི་བསོད་ནམས་ཕུང་པོ་ཞེས་བྱའོ། །
en: Heap of Merit will be his father.

source: ཡུམ་ནི་ཆོས་ཀྱི་བློ་གྲོས་མ་ཞེས་བྱའོ། །
en: Dharma Intelligence will be his mother.

source: སྲས་ནི་ཙམ་པའི་མཆོག་ཅེས་བྱའོ། །
en: Supreme Campaka will be his son.

source: རིམ་གྲོ་པ་ནི་ཤིན་ཏུ་སྤོབས་པ་ཞེས་བྱའོ། །
en: Great Acumen will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་འབྲུག་སྒྲ་ཞེས་བྱའོ། །
en: Sound of Thunder will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཡེ་ཤེས་བླ་མ་ཞེས་བྱའོ། །
en: Highest Wisdom will be foremost in terms of miraculous abilities.

source: འདུས་པ་དང་པོ་ལ་ནི་ཉན་ཐོས་ས་ཡ་ཕྲག་བདུན་ནོ། །གཉིས་པ་ལ་ནི་ས་ཡ་ཕྲག་བརྒྱད་དོ། །གསུམ་པ་ལ་ནི་ས་ཡ་ཕྲག་དགུའོ། །
en: His first congregation will consist of seven million hearers, his second of eight million hearers, and his third of nine million hearers.

source: དམ་པའི་ཆོས་ནི་ལོ་སུམ་འབུམ་གྱི་བར་དུ་གནས་སོ། །
en: His sacred Dharma will remain for three hundred thousand years.

source: དེ་བཞིན་གཤེགས་པ་འོད་བཟང་སྐྱེ་བའི་ཡུལ་ནི་གྲོང་ཁྱེར་སྐར་འོད་ཅེས་བྱའོ། །
en: “The birthplace of the thus-gone Suprabha will be the city called Starlight.

source: འོད་ནི་དཔག་ཚད་བཅུ་གསུམ་མོ། །
en: His light will extend thirteen leagues.

source: ཡབ་ནི་ཉི་མའི་མཐུ་ཞེས་བྱའོ། །
en: Sun Power will be his father.

source: ཡུམ་ནི་ཟླ་ལྡན་མ་ཞེས་བྱའོ། །
en: Moon Possessor will be his mother.

source: སྲས་ནི་དབང་ཕྱུག་ཆེན་པོ་ཞེས་བྱའོ། །
en: Great Lord will be his son.

source: རིམ་གྲོ་པ་ནི་སྟོབས་བརྟན་ཞེས་བྱའོ། །
en: Stable Power will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཡེ་ཤེས་བྱིན་ཞེས་བྱའོ། །
en: Wisdom Gift will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ལུས་མདངས་ཅན་ཞེས་བྱའོ། །
en: Body of Brightness will be foremost in terms of miraculous abilities.

source: འདུས་པ་དང་པོ་ལ་ནི་ཉན་ཐོས་ཐེར་འབུམ་ཕྲག་ལྔའོ། །གཉིས་པ་ལ་ནི་དུང་ཕྱུར་ཕྲག་བཞིའོ། །གསུམ་པ་ལ་ནི་དུང་ཕྱུར་ཕྲག་གསུམ་དང་བྱེ་བ་ཕྲག་ལྔའོ། །
en: His first congregation will consist of five billion hearers, his second of four hundred million hearers, and his third of three hundred fifty million hearers.

source: སྐུ་ཚེའི་ཚད་ནི་ལོ་བརྒྱད་ཁྲི་ལྔ་སྟོང་ངོ་། །
en: The extent of his lifespan will be eighty-five thousand years.

source: དམ་པའི་ཆོས་ནི་ལོ་བཞི་ཁྲིའི་བར་དུ་གནས་སོ། །
en: His sacred Dharma will remain for forty thousand years.

source: དེ་བཞིན་གཤེགས་པ་མྱ་ངན་མེད་སྐྱེ་བའི་ཡུལ་ནི་གྲོང་ཁྱེར་ཤེས་རབ་བྱིན་ཞེས་བྱའོ། །
en: “The birthplace of the thus-gone Aśoka will be the city called Insight Gift.

source: འོད་ནི་དཔག་ཚད་བཅྭ་བརྒྱད་དོ། །
en: His light will extend eighteen leagues.

source: ཡབ་ནི་མེ་ཏོག་བྱིན་ཞེས་བྱའོ། །
en: Flower Gift will be his father.

source: ཡུམ་ནི་ཆོས་ཅན་མ་ཞེས་བྱའོ། །
en: Endowed with Dharma will be his mother.

source: སྲས་ནི་འོད་སྦྱིན་ཞེས་བྱའོ། །
en: Light Gift will be his son.

source: རིམ་གྲོ་པ་ནི་དགའ་དབྱངས་ཞེས་བྱའོ། །
en: Melody of Joy will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ལྷུན་པོ་བརྩེགས་པ་ཞེས་བྱའོ། །
en: Great Mountain will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་རྒྱལ་བས་བྱིན་ཞེས་བྱའོ། །
en: Given by the Victor will be foremost in terms of miraculous abilities.

source: འདུས་པ་དང་པོ་ལ་ནི་ཉན་ཐོས་ཉི་ཁྲིའོ། །གཉིས་པ་ལ་ནི་ཁྲིའོ། །འདུས་པ་གསུམ་པ་ལ་ནི་དགུ་འབུམ་ལྔ་ཁྲིའོ། །
en: His first congregation will consist of twenty thousand hearers, his second of ten thousand hearers, and his third of nine hundred fifty thousand hearers.

source: དེ་བཞིན་གཤེགས་པ་སྐར་རྒྱལ་སྐྱེ་བའི་ཡུལ་ནི་གྲོང་ཁྱེར་ཙམ་པའི་མཆོག་ཅེས་བྱའོ། །
en: “The birthplace of the thus-gone Tiṣya will be the city called Supreme Campaka.

source: ཡབ་ནི་ལྷ་བཟང་ཞེས་བྱའོ། །
en: Divine Excellence will be his father.

source: ཡུམ་ནི་སྦྱིན་དགའ་ཞེས་བྱའོ། །
en: Generosity Joy will be his mother.

source: སྲས་ནི་གློག་གི་འོད་ཅེས་བྱའོ། །
en: Flash of Light will be his son.

source: རིམ་གྲོ་པ་ནི་མཐོང་དགའ་ཞེས་བྱའོ། །
en: Joyous Sight will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཡེ་ཤེས་བླ་མ་ཞེས་བྱའོ། །
en: Highest Wisdom will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་འཇིག་རྟེན་བླ་མ་ཞེས་བྱའོ། །
en: Superior to the World will be foremost in terms of miraculous abilities.

source: འདུས་པ་དང་པོ་ལ་ནི་ཉན་ཐོས་དུང་ཕྱུར་ཕྲག་བརྒྱད་དོ། །གཉིས་པ་ལ་ནི་དུང་ཕྱུར་ཕྲག་བདུན་དང་བྱེ་བ་ཕྲག་བརྒྱད་དོ། །གསུམ་པ་ལ་ནི་དུང་ཕྱུར་ཕྲག་བདུན་ནོ། །
en: His first congregation will consist of eight hundred million hearers, his second of seven hundred eighty million hearers, and his third of seven hundred million hearers.

source: སྐུ་ཚེའི་ཚད་ནི་ལོ་སུམ་ཁྲི་ཉིས་སྟོང་ངོ་། །
en: The extent of his lifespan will be thirty-two thousand years.

source: དེ་བཞིན་གཤེགས་པ་རབ་གསལ་སྐྱེ་བའི་ཡུལ་ནི་གླིང་ལྡན་ཞེས་བྱའོ། །
en: “The birthplace of the thus-gone Pradyota will be called Endowed with Islands.

source: འོད་ནི་སྟོང་གི་འཇིག་རྟེན་གྱི་ཁམས་ཙམ་མོ། །
en: His light will extend a thousand worlds.

source: ཡབ་ནི་ཆོས་འཕགས་ཞེས་བྱའོ། །
en: Superior Dharma will be his father.

source: ཡུམ་ནི་པད་མ་ཅན་ཞེས་བྱའོ། །
en: Lotus Possessor will be his mother.

source: སྲས་ནི་ཟླ་རྐང་ཞེས་བྱའོ། །
en: Moon Foot will be his son.

source: རིམ་གྲོ་པ་ནི་གྲགས་པའི་དབྱངས་ཞེས་བྱའོ། །
en: Melody of Fame will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་བསོད་ནམས་དཔལ་ཞེས་བྱའོ། །
en: Glorious Merit will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་རྡོ་རྗེ་བྱིན་ཞེས་བྱའོ། །
en: Vajra Gift will be foremost in terms of miraculous abilities.

source: འདུས་པ་དང་པོ་ལ་ནི་ཉན་ཐོས་དུང་ཕྱུར་ཕྲག་གཅིག་དང་བྱེ་བ་ཕྲག་དྲུག་གོ། །གཉིས་པ་ལ་ནི་དུང་ཕྱུར་ཕྲག་གཅིག་དང་བྱེ་བ་ཕྲག་བདུན་ནོ། །གསུམ་པ་ལ་ནི་དུང་ཕྱུར་ཕྲག་གཅིག་དང་བྱེ་བ་ཕྲག་བརྒྱད་དོ། །
en: His first congregation will consist of one hundred sixty million hearers, his second of one hundred seventy million hearers, and his third of one hundred eighty million hearers.

source: སྐུ་ཚེའི་ཚད་ནི་ལོ་ཁྲི་བཞི་སྟོང་ངོ་། །
en: The extent of his lifespan will be fourteen thousand years.

source: དམ་པའི་ཆོས་ནི་ལོ་ཉི་ཁྲི་ཆིག་སྟོང་གི་བར་དུ་གནས་སོ། །
en: His sacred Dharma will remain for twenty-one thousand years.

source: དེ་བཞིན་གཤེགས་པ་ཕྲེང་ཐོགས་སྐྱེ་བའི་ཡུལ་ནི་གྲོང་ཁྱེར་བསོད་ནམས་ཀྱི་འབྱུང་གནས་ཞེས་བྱའོ། །
en: “The birthplace of the thus-gone Mālādhārin will be the city called Source of Merit.

source: འོད་ནི་དཔག་ཚད་བརྒྱད་ཅུའོ། །
en: His light will extend eighty leagues.

source: ཡབ་ནི་པད་མ་དཀར་པོ་ཞེས་བྱའོ། །
en: White Lotus will be his father.

source: ཡུམ་ནི་ཡོན་ཏན་བྱིན་ཞེས་བྱའོ། །
en: Gift of Qualities will be his mother.

source: སྲས་ནི་དཔལ་གྱི་བསོད་ནམས་ཞེས་བྱའོ། །
en: Glory of Merit will be his son.

source: རིམ་གྲོ་པ་ནི་གཟུགས་བཟང་ཞེས་བྱའོ། །
en: Excellent Form will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་སྒྲོན་མ་མཐའ་ཡས་ཞེས་བྱའོ། །
en: Infinite Lamp will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཚོགས་ཅན་རྒྱལ་པོ་ཞེས་བྱའོ། །
en: King of the Gathering will be foremost in terms of miraculous abilities.

source: འདུས་པ་དང་པོ་ལ་ནི་ཉན་ཐོས་དགྲ་བཅོམ་པ་དུང་ཕྱུར་ཕྲག་དགུའོ། །གཉིས་པ་ལ་ནི་དུང་ཕྱུར་ཕྲག་དགུ་དང་བྱེ་བ་ཕྲག་དགུའོ། །གསུམ་པ་ལ་ནི་དུང་ཕྱུར་ཕྲག་བརྒྱད་དང་བྱེ་བ་ཕྲག་བརྒྱད་དོ། །
en: His first congregation will consist of nine hundred million worthy hearers, his second of nine hundred ninety million worthy hearers, and his third of eight hundred eighty million worthy hearers.

source: དེ་བཞིན་གཤེགས་པ་ཡོན་ཏན་འོད་སྐྱེ་བའི་ཡུལ་ནི་གྲོང་ཁྱེར་ཨུད་པ་ལ་ཞེས་བྱའོ། །
en: “The birthplace of the thus-gone Guṇaprabha will be the city called Utpala.

source: ཡབ་ནི་སྣང་ལྡན་ཞེས་བྱའོ། །
en: Endowed with Light will be his father.

source: ཡུམ་ནི་བསོད་ནམས་ཕུང་པོ་ཞེས་བྱའོ། །
en: Heap of Merit will be his mother.

source: སྲས་ནི་ཆོས་སྤོབས་ཞེས་བྱའོ། །
en: Dharma Acumen will be his son.

source: རིམ་གྲོ་པ་ནི་བསོད་ནམས་མཆོད་འོས་ཞེས་བྱའོ། །
en: Merit Worthy of Worship will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་བཻ་དཱུརྱའི་སྙིང་པོ་ཞེས་བྱའོ། །
en: Beryl Essence will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་སས་བྱིན་ཞེས་བྱའོ། །
en: Granted by the Ground will be foremost in terms of miraculous abilities.

source: འདུས་པ་དང་པོ་ལ་ནི་ཉན་ཐོས་བྱེ་བ་བརྒྱ་ཕྲག་བཅུ་དྲུག་གོ། །གཉིས་པ་ལ་ནི་བྱེ་བ་བརྒྱ་ཕྲག་བཅུ་གཉིས་སོ། །གསུམ་པ་ལ་ནི་བྱེ་བ་བརྒྱ་ཕྲག་བཅྭ་བརྒྱད་དོ། །
en: His first congregation will consist of sixteen billion hearers, his second of twelve billion hearers, and his third of eighteen billion hearers.

source: སྐུ་ཚེའི་ཚད་ནི་ལོ་སུམ་སྟོང་ངོ་། །
en: The extent of his lifespan will be three thousand years.

source: དེ་བཞིན་གཤེགས་པ་དོན་གཟིགས་སྐྱེ་བའི་ཡུལ་ནི་གྲོང་ཁྱེར་སྙིང་པོའི་མཆོག་ཅེས་བྱའོ། །
en: “The birthplace of the thus-gone Arthadarśin will be the city called Supreme Essence.

source: འོད་ནི་དཔག་ཚད་དྲུག་ཅུ་རྩ་གཉིས་སོ། །
en: His light will extend sixty-two leagues.

source: ཡབ་ནི་ཡུལ་འཁོར་ཟླ་བ་ཞེས་བྱའོ། །
en: Moon of the Land will be his father.

source: ཡུམ་ནི་ལྷ་དགའ་ཞེས་བྱའོ། །
en: Divine Joy will be his mother.

source: སྲས་ནི་ཡོན་ཏན་གྲགས་པ་ཞེས་བྱའོ། །
en: Renowned Qualities will be his son.

source: རིམ་གྲོ་པ་ནི་ཚངས་པའི་ང་རོ་ཞེས་བྱའོ། །
en: Brahmā Roar will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཟླ་བའི་བློ་ཞེས་བྱའོ། །
en: Moon Mind will be foremost in terms of insight.

source: འདུས་པ་དང་པོ་ལ་ནི་དགྲ་བཅོམ་པ་དྲུག་འབུམ་ཉི་ཁྲིའོ། །གཉིས་པ་ལ་ནི་བདུན་འབུམ་མོ། །གསུམ་པ་ལ་ནི་བརྒྱད་འབུམ་མོ། །
en: His first congregation will consist of six hundred twenty thousand worthy ones, his second of seven hundred thousand worthy ones, and his third of eight hundred thousand worthy ones.

source: དེ་བཞིན་གཤེགས་པ་མར་མེ་སྐྱེ་བའི་ཡུལ་ནི་གྲོང་ཁྱེར་རིན་ཆེན་མཛེས་པ་ཞེས་བྱའོ། །
en: “The birthplace of the thus-gone Pradīpa will be the city called Beautiful Jewel.

source: འོད་ནི་དཔག་ཚད་ལྔ་བཅུའོ། །
en: His light will extend fifty leagues.

source: ཡབ་ནི་རིན་ཆེན་སོ་ཞེས་བྱའོ། །
en: Jewel Edge will be his father.

source: ཡུམ་ནི་སྐར་མདོག་ཅེས་བྱའོ། །
en: Star Color will be his mother.

source: སྲས་ནི་རིན་ཆེན་སྙིང་པོ་ཞེས་བྱའོ། །
en: Jewel Essence will be his son.

source: རིམ་གྲོ་པ་ནི་བློ་གསལ་ཞེས་བྱའོ། །
en: Clear Mind will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཐུབ་མེད་ཅེས་བྱའོ། །
en: Indomitable will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་སྟོབས་ཅན་ཞེས་བྱའོ། །
en: Endowed with Power will be foremost in terms of miraculous abilities.

source: འདུས་པ་དང་པོ་ལ་ནི་ཉན་ཐོས་བདུན་འབུམ་མོ། །གཉིས་པ་ལ་ནི་དགུ་འབུམ་མོ། །གསུམ་པ་ལ་ནི་ས་ཡའོ། །
en: His first congregation will consist of seven hundred thousand hearers, his second of nine hundred thousand hearers, and his third of one million hearers.

source: དམ་པའི་ཆོས་ནི་ལོ་ཉིས་འབུམ་གྱི་བར་དུ་གནས་སོ། །
en: His sacred Dharma will remain for two hundred thousand years.

source: དེ་བཞིན་གཤེགས་པ་མཐུ་ལྡན་སྐྱེ་བའི་ཡུལ་ནི་གྲོང་ཁྱེར་གཟི་བརྗིད་འོད་ཅེས་བྱའོ། །
en: “The birthplace of the thus-gone Prabhūta will be the city called Splendid Light.

source: ཡབ་ནི་ལེགས་བྱིན་ཞེས་བྱའོ། །
en: Excellent Gift will be his father.

source: ཡུམ་ནི་ཡིད་ལྡན་ལེགས་མོ་ཞེས་བྱའོ། །
en: Endowed with Excellent Thought will be his mother.

source: སྲས་ནི་རྒྱལ་བའི་བཤེས་གཉེན་ཞེས་བྱའོ། །
en: Friend of the Victorious Ones will be his son.

source: རིམ་གྲོ་པ་ནི་སེང་གེའི་སྟོབས་ཞེས་བྱའོ། །
en: Lion Strength will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་མྱ་ངན་མེད་བྱིན་ཞེས་བྱའོ། །
en: Gift of Freedom from Suffering will be foremost in terms of insight,

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་རི་བརྩེགས་ཞེས་བྱའོ། །
en: and Lofty Mountain will be foremost in terms of miraculous abilities.

source: འདུས་པ་དང་པོ་ལ་ནི་ཉན་ཐོས་བྱེ་བ་ཕྲག་གསུམ་མོ། །གཉིས་པ་ལ་ནི་ཐེར་འབུམ་ཕྲག་གཉིས་སོ། །གསུམ་པ་ལ་ནི་ཐེར་འབུམ་མོ། །
en: His first congregation will consist of thirty million hearers, his second of two billion hearers, and his third of one billion hearers.

source: དེ་བཞིན་གཤེགས་པ་སྨན་པ་སྐྱེ་བའི་ཡུལ་ནི་བརྟུལ་ཞུགས་གྲུབ་པ་ཞེས་བྱའོ། །
en: “The birthplace of the thus-gone Vaidya will be called Accomplishment of Yogic Discipline.

source: འོད་ནི་དཔག་ཚད་བདུན་ཅུ་རྩ་བདུན་ནོ། །
en: His light will extend seventy-seven leagues.

source: ཡབ་ནི་འདུན་པ་ཞེས་བྱའོ། །
en: Intention will be his father.

source: ཡུམ་ནི་འཛམ་བུའི་མཆོག་ཅེས་བྱའོ། །
en: Supreme Jambu will be his mother.

source: སྲས་ནི་དཔས་བྱིན་ཞེས་བྱའོ། །
en: Hero Gift will be his son.

source: རིམ་གྲོ་པ་ནི་ཟླ་དགའ་ཞེས་བྱའོ། །
en: Moon Joy will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་རྒྱ་མཚོ་ཞེས་བྱའོ། །
en: Ocean will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་གླང་པོའི་སྟོབས་ཞེས་བྱའོ། །
en: Elephant Power will be foremost in terms of miraculous abilities.

source: འདུས་པ་དང་པོ་ལ་ནི་ཉན་ཐོས་ས་ཡ་ཕྲག་གཉིས་དང་འབུམ་ཕྲག་གསུམ་མོ། །གཉིས་པ་ལ་ནི་ས་ཡ་ཕྲག་གཉིས་དང་འབུམ་ཕྲག་ལྔའོ། །གསུམ་པ་ལ་ནི་ས་ཡ་ཕྲག་གཉིས་དང་འབུམ་ཕྲག་བརྒྱད་དོ། །
en: His first congregation will consist of two million three hundred thousand hearers, his second of two million five hundred thousand hearers, and his third of two million eight hundred thousand hearers.

source: དམ་པའི་ཆོས་ནི་ལོ་ས་ཡ་ཕྲག་གཉིས་དང་འབུམ་ཕྲག་ལྔའི་བར་དུ་གནས་སོ། །
en: His sacred Dharma will remain for two million five hundred thousand years.

source: དེ་བཞིན་གཤེགས་པ་དེས་པ་སྐྱེ་བའི་ཡུལ་ནི་གྲོང་ཁྱེར་ལེགས་འབྱོར་ཅེས་བྱའོ། །
en: “The birthplace of the thus-gone Sūrata will be the city called Excellent Wealth.

source: འོད་ནི་དཔག་ཚད་བཅུའོ། །
en: His light will extend ten leagues.

source: ཡབ་ནི་དབྱིག་མཆོག་ཅེས་བྱའོ། །
en: Supreme Treasure will be his father.

source: ཡུམ་ནི་ཟླ་འོད་ཅེས་བྱའོ། །
en: Moonlight will be his mother.

source: སྲས་ནི་ཆོས་ཀྱི་དབང་ཕྱུག་ཅེས་བྱའོ། །
en: Lord of Dharma will be his son.

source: རིམ་གྲོ་པ་ནི་འཇིག་རྟེན་དགའ་བ་ཞེས་བྱའོ། །
en: Joy for the World will be his attendant.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་མེ་ཏོག་བྱིན་ཞེས་བྱའོ། །
en: Flower Gift will be foremost in terms of miraculous abilities.

source: འདུས་པ་དང་པོ་ལ་ནི་ཉན་ཐོས་དུང་ཕྱུར་ཕྲག་གསུམ་མོ། །གཉིས་པ་ལ་ནི་དུང་ཕྱུར་ཕྲག་གཉིས་དང་བྱེ་བ་ཕྲག་བརྒྱད་དོ། །གསུམ་པ་ལ་ནི་དུང་ཕྱུར་ཕྲག་གཉིས་དང་བྱེ་བ་ཕྲག་བདུན་ནོ། །
en: His first congregation will consist of three hundred million hearers, his second of two hundred eighty million hearers, and his third of two hundred seventy million hearers.

source: སྐུ་ཚེའི་ཚད་ནི་ལོ་སུམ་ཁྲི་དྲུག་སྟོང་ངོ་། །
en: The extent of his lifespan will be thirty-six thousand years.

source: དེ་བཞིན་གཤེགས་པ་མཛོད་སྤུ་སྐྱེ་བའི་ཡུལ་ནི་གྲོང་ཁྱེར་གཟི་བརྗིད་གསལ་བ་ཞེས་བྱའོ། །
en: “The birthplace of the thus-gone Ūrṇa will be the city called Radiant Splendor.

source: འོད་ནི་དཔག་ཚད་བརྒྱ་ཙམ་མོ། །
en: His light will extend one hundred leagues.

source: ཡབ་ནི་ཚོགས་ཅན་གྱི་རྒྱལ་པོ་ཞེས་བྱའོ། །
en: King of the Gathering will be his father.

source: ཡུམ་ནི་སྐལ་ལྡན་དགའ་ཞེས་བྱའོ། །
en: Fortunate Joy will be his mother.

source: སྲས་ནི་ལྷུན་པོ་སྦྱིན་ཞེས་བྱའོ། །
en: Mountain Gift will be his son.

source: རིམ་གྲོ་པ་ནི་ལྷའི་ཟླ་བ་ཞེས་བྱའོ། །
en: Divine Moon will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཡེ་ཤེས་དགའ་ཞེས་བྱའོ། །
en: Wisdom Joy will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ལྷས་མཆོད་ཅེས་བྱའོ། །
en: Worshiped by Gods will be foremost in terms of miraculous abilities.

source: འདུས་པ་དང་པོ་ལ་ནི་ཉན་ཐོས་དུང་ཕྱུར་ཕྲག་དྲུག་དང་བྱེ་བ་ཕྲག་གཉིས་སོ། །གཉིས་པ་ལ་ནི་དུང་ཕྱུར་ཕྲག་དྲུག་དང་བྱེ་བ་ཕྲག་གཅིག་གོ། །གསུམ་པ་ལ་ནི་དུང་ཕྱུར་ཕྲག་དྲུག་གོ། །
en: His first congregation will consist of six hundred twenty million hearers, his second of six hundred ten million hearers, and his third of six hundred million hearers.

source: དེ་བཞིན་གཤེགས་པ་བརྟན་ལྡན་སྐྱེ་བའི་ཡུལ་ནི་བསོད་ནམས་སྒྲ་སྒྲོགས་ཞེས་བྱའོ། །
en: “The birthplace of the thus-gone Dṛḍha will be called Sound of Merit.

source: ཡབ་ནི་ས་ལའི་རྒྱལ་པོ་ཞེས་བྱའོ། །
en: Śāla King will be his father.

source: ཡུམ་ནི་སྐྱེས་བུ་བཟང་དགའ་ཞེས་བྱའོ། །
en: Joy of Good People will be his mother.

source: སྲས་ནི་སྲིད་སྦྱིན་ཞེས་བྱའོ། །
en: Gift to the World will be his son.

source: རིམ་གྲོ་པ་ནི་དཔལ་སྟོབས་ཞེས་བྱའོ། །
en: Splendid Power will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཟླ་བའི་ཏོག་ཅེས་བྱའོ། །
en: Moon Crest will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཡོན་ཏན་འོད་ཅེས་བྱའོ། །
en: Luminous Qualities will be foremost in terms of miraculous abilities.

source: འདུས་པ་དང་པོ་ལ་ནི་ཉན་ཐོས་འབུམ་མོ། །གཉིས་པ་ལ་ནི་ས་ཡ་ཕྲག་དགུའོ། །འདུས་པ་གསུམ་པ་ལ་ནི་ས་ཡ་ཕྲག་བརྒྱད་དོ། །
en: His first congregation will consist of one hundred thousand hearers, his second of nine million hearers, and his third of eight million hearers.

source: སྐུ་ཚེའི་ཚད་ནི་ལོ་ཁྲི་ཉིས་སྟོང་ངོ་། །
en: The extent of his lifespan will be twelve thousand years.

source: དམ་པའི་ཆོས་ནི་ལོ་ཉི་ཁྲི་བརྒྱད་སྟོང་གི་བར་དུ་གནས་སོ། །
en: His sacred Dharma will remain for twenty-eight thousand years.

source: དེ་བཞིན་གཤེགས་པ་ལྷའི་དཔལ་སྐྱེ་བའི་ཡུལ་ནི་རིན་ཆེན་ལྡན་པ་ཞེས་བྱའོ། །
en: “The birthplace of the thus-gone Śrīdeva will be called Endowed with Jewels.

source: ཡབ་ནི་སྦྲང་རྩིའི་སྣོད་ཅེས་བྱའོ། །
en: Honey Vessel will be his father.

source: སྲས་ནི་དགའ་བའི་ཏོག་ཅེས་བྱའོ། །
en: Crown of Joy will be his son.

source: རིམ་གྲོ་པ་ནི་བརྩོན་འགྲུས་བརྟན་ཞེས་བྱའོ། །
en: Firm Endeavor will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ས་སྦྱིན་ཞེས་བྱའོ། །
en: Earth Gift will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཟླ་སྟོབས་ཅན་ཞེས་བྱའོ། །
en: Powerful Moon will be foremost in terms of miraculous abilities.

source: འདུས་པ་ནི་ལན་ཅིག་སྟེ། ཉན་ཐོས་ཐེར་འབུམ་ཕྲག་གཅིག་གོ། །
en: He will have one congregation, containing one billion hearers.

source: དེ་བཞིན་གཤེགས་པ་གདུལ་དཀའ་སྐྱེ་བའི་ཡུལ་ནི་སྦྱོར་གྲུབ་ཅེས་བྱའོ། །
en: “The birthplace of the thus-gone Duṣpradharṣa will be called Application Accomplished.

source: འོད་ནི་དཔག་ཚད་བྱེ་བའོ། །
en: His light will extend ten million leagues.

source: ཡབ་ནི་སྒྲ་གཅན་ལྷ་ཞེས་བྱའོ། །
en: Divine Rāhu will be his father.

source: ཡུམ་ནི་བསོད་ནམས་ཅན་ཞེས་བྱའོ། །
en: Endowed with Merit will be his mother.

source: སྲས་ནི་ཟླ་སྦེད་ཅེས་བྱའོ། །
en: Hidden Moon will be his son.

source: རིམ་གྲོ་པ་ནི་བདེན་དགའ་ཞེས་བྱའོ། །
en: Joyous Truth will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་རིན་ཆེན་དམ་པ་ཞེས་བྱའོ། །
en: True Jewel will be foremost in terms of insight.

source: འདུས་པ་དང་པོ་ལ་ནི་ཉན་ཐོས་སུམ་འབུམ་མོ། །གཉིས་པ་ལ་ནི་ལྔ་འབུམ་མོ། །གསུམ་པ་ལ་ནི་བརྒྱད་འབུམ་མོ། །
en: His first congregation will consist of three hundred thousand hearers, his second of five hundred thousand hearers, and his third of eight hundred thousand hearers.

source: དམ་པའི་ཆོས་ནི་ལོ་དུང་ཕྱུར་ཕྲག་གཅིག་དང་བྱེ་བ་ཕྲག་བརྒྱད་ཀྱི་བར་དུ་གནས་སོ། །
en: His sacred Dharma will remain for one hundred eighty million years.

source: དེ་བཞིན་གཤེགས་པ་ཡོན་ཏན་རྒྱལ་མཚན་སྐྱེ་བའི་ཡུལ་ནི་ཟླ་ལྡན་ཞེས་བྱའོ། །
en: “The birthplace of the thus-gone Guṇadhvaja will be called Moon Bearing.

source: རིགས་ནི་བྲམ་ཟེའི་རིགས་སོ། །
en: His family will be brahmin.

source: ཡབ་ནི་སྐར་རྒྱལ་བཤེས་གཉེན་ཞེས་བྱའོ། །
en: Friend of the Royal Star will be his father.

source: ཡུམ་ནི་ནོར་ལྷས་བྱིན་ཞེས་བྱའོ། །
en: Gift of the Wealth God will be his mother.
